package main

import (
	"fmt"

	survey "github.com/AlecAivazis/survey/v2"
)

var qs = []*survey.Question{
	{
		Name: "quantity",
		Prompt: &survey.Select{
			Message: "Сколько людей вы планируете перевозить?",
			Options: []string{"1-4", "4-7", ">7"},
			Default: "1-4",
		},
	},
	{
		Name: "engine",
		Prompt: &survey.Select{
			Message: "Какой тип двигателя вы предпочитаете?",
			Options: []string{"Бензин", "Дизель", "Гибрид"},
			Default: "Бензин",
		},
	},
	{
		Name: "road",
		Prompt: &survey.Select{
			Message: "Какой тип дороги вы собираетесь использовать?",
			Options: []string{"Городские", "Загородные", "Пересеченные местности"},
			Default: "Городские",
		},
	},
	{
		Name: "budget",
		Prompt: &survey.Select{
			Message: "Какой бюджет у вас есть?",
			Options: []string{"<100 000", "100 000 - 500 000", "500 000 - 800 000", "800 000 - 1 000 000", ">1 000 000"},
			Default: "<100 000",
		},
	},
}

type car struct {
	Quantity string
	Engine   string
	Road     string
	Budget   string
}

var answers = car{}

func main() {
	err := survey.Ask(qs, &answers)
	if err != nil {
		fmt.Println(err.Error())
		return
	}
	Decision()
}

func Decision() {
	result, isHere := cars[answers]
	if !isHere {
		fmt.Println("У нас нет подходящей машины для вас")
	} else {
		fmt.Println("Подходящая машина по вашему запросу:", result)
	}
}

var cars = map[car]string{
	{"1-4", "Бензин", "Городские", "<100 000"}:                         "Toyota Camry",
	{"1-4", "Бензин", "Городские", "100 000 - 500 000"}:                "Ford Mustang",
	{"1-4", "Бензин", "Городские", "500 000 - 800 000"}:                "Honda Civic",
	{"1-4", "Бензин", "Городские", "800 000 - 1 000 000"}:              "Chevrolet Silverado",
	{"1-4", "Бензин", "Городские", ">1 000 000"}:                       "Volkswagen Jetta",
	{"1-4", "Бензин", "Загородные", "<100 000"}:                        "BMW 3 Series",
	{"1-4", "Бензин", "Загородные", "100 000 - 500 000"}:               "Nissan Altima",
	{"1-4", "Бензин", "Загородные", "500 000 - 800 000"}:               "Jeep Wrangler",
	{"1-4", "Бензин", "Загородные", "800 000 - 1 000 000"}:             "Hyundai Sonata",
	{"1-4", "Бензин", "Загородные", ">1 000 000"}:                      "Dodge Ram",
	{"1-4", "Бензин", "Пересеченные местности", "<100 000"}:            "Audi A4",
	{"1-4", "Бензин", "Пересеченные местности", "100 000 - 500 000"}:   "Subaru Outback",
	{"1-4", "Бензин", "Пересеченные местности", "500 000 - 800 000"}:   "Mercedes-Benz C-Class",
	{"1-4", "Бензин", "Пересеченные местности", "800 000 - 1 000 000"}: "Kia Sportage",
	{"1-4", "Бензин", "Пересеченные местности", ">1 000 000"}:          "Lexus RX",
	{"1-4", "Дизель", "Городские", "<100 000"}:                         "Mazda CX-5",
	{"1-4", "Дизель", "Городские", "100 000 - 500 000"}:                "Volvo XC90",
	{"1-4", "Дизель", "Городские", "500 000 - 800 000"}:                "Cadillac Escalade",
	{"1-4", "Дизель", "Городские", "800 000 - 1 000 000"}:              "Tesla Model S",
	{"1-4", "Дизель", "Городские", ">1 000 000"}:                       "GMC Sierra",
	{"1-4", "Дизель", "Загородные", "<100 000"}:                        "Buick Encore",
	{"1-4", "Дизель", "Загородные", "100 000 - 500 000"}:               "Lincoln Navigator",
	{"1-4", "Дизель", "Загородные", "500 000 - 800 000"}:               "Jaguar F-PACE",
	{"1-4", "Дизель", "Загородные", "800 000 - 1 000 000"}:             "Porsche 911",
	{"1-4", "Дизель", "Загородные", ">1 000 000"}:                      "Acura RDX",
	{"1-4", "Дизель", "Пересеченные местности", "<100 000"}:            "Mini Cooper",
	{"1-4", "Дизель", "Пересеченные местности", "100 000 - 500 000"}:   "Fiat 500",
	{"1-4", "Дизель", "Пересеченные местности", "500 000 - 800 000"}:   "Chrysler 300",
	{"1-4", "Дизель", "Пересеченные местности", "800 000 - 1 000 000"}: "Land Rover Range Rover",
	{"1-4", "Дизель", "Пересеченные местности", ">1 000 000"}:          "Infiniti Q50",
	{"1-4", "Гибрид", "Городские", "<100 000"}:                         "Mitsubishi Outlander",
	{"1-4", "Гибрид", "Городские", "100 000 - 500 000"}:                "Nissan Rogue",
	{"1-4", "Гибрид", "Городские", "500 000 - 800 000"}:                "Toyota Corolla",
	{"1-4", "Гибрид", "Городские", "800 000 - 1 000 000"}:              "Ford Explorer",
	{"1-4", "Гибрид", "Городские", ">1 000 000"}:                       "Jeep Grand Cherokee",
	{"1-4", "Гибрид", "Загородные", "<100 000"}:                        "Chevrolet Equinox",
	{"1-4", "Гибрид", "Загородные", "100 000 - 500 000"}:               "Volkswagen Passat",
	{"1-4", "Гибрид", "Загородные", "500 000 - 800 000"}:               "Hyundai Elantra",
	{"1-4", "Гибрид", "Загородные", "800 000 - 1 000 000"}:             "Subaru Forester",
	{"1-4", "Гибрид", "Загородные", ">1 000 000"}:                      "BMW 5 Series",
	{"1-4", "Гибрид", "Пересеченные местности", "<100 000"}:            "Mercedes-Benz E-Class",
	{"1-4", "Гибрид", "Пересеченные местности", "100 000 - 500 000"}:   "Kia Optima",
	{"1-4", "Гибрид", "Пересеченные местности", "500 000 - 800 000"}:   "Lexus ES",
	{"1-4", "Гибрид", "Пересеченные местности", "800 000 - 1 000 000"}: "Audi Q5",
	{"1-4", "Гибрид", "Пересеченные местности", ">1 000 000"}:          "Mazda3",
	{"4-7", "Бензин", "Городские", "<100 000"}:                         "Volvo S60",
	{"4-7", "Бензин", "Городские", "100 000 - 500 000"}:                "Cadillac XT5",
	{"4-7", "Бензин", "Городские", "500 000 - 800 000"}:                "Tesla Model 3",
	{"4-7", "Бензин", "Городские", "800 000 - 1 000 000"}:              "GMC Terrain",
	{"4-7", "Бензин", "Городские", ">1 000 000"}:                       "Buick Enclave",
	{"4-7", "Бензин", "Загородные", "<100 000"}:                        "Lincoln Aviator",
	{"4-7", "Бензин", "Загородные", "100 000 - 500 000"}:               "Jaguar XF",
	{"4-7", "Бензин", "Загородные", "500 000 - 800 000"}:               "Porsche Cayenne",
	{"4-7", "Бензин", "Загородные", "800 000 - 1 000 000"}:             "Acura MDX",
	{"4-7", "Бензин", "Загородные", ">1 000 000"}:                      "Mini Countryman",
	{"4-7", "Бензин", "Пересеченные местности", "<100 000"}:            "Fiat 500X",
	{"4-7", "Бензин", "Пересеченные местности", "100 000 - 500 000"}:   "Chrysler Pacifica",
	{"4-7", "Бензин", "Пересеченные местности", "500 000 - 800 000"}:   "Land Rover Discovery",
	{"4-7", "Бензин", "Пересеченные местности", "800 000 - 1 000 000"}: "Infiniti QX60",
	{"4-7", "Бензин", "Пересеченные местности", ">1 000 000"}:          "Mitsubishi Eclipse Cross",
	{"4-7", "Дизель", "Городские", "<100 000"}:                         "Nissan Pathfinder",
	{"4-7", "Дизель", "Городские", "100 000 - 500 000"}:                "Toyota Tacoma",
	{"4-7", "Дизель", "Городские", "500 000 - 800 000"}:                "Ford F-150",
	{"4-7", "Дизель", "Городские", "800 000 - 1 000 000"}:              "Jeep Renegade",
	{"4-7", "Дизель", "Городские", ">1 000 000"}:                       "Chevrolet Traverse",
	{"4-7", "Дизель", "Загородные", "<100 000"}:                        "Volkswagen Tiguan",
	{"4-7", "Дизель", "Загородные", "100 000 - 500 000"}:               "Hyundai Santa Fe",
	{"4-7", "Дизель", "Загородные", "500 000 - 800 000"}:               "Subaru Legacy",
	{"4-7", "Дизель", "Загородные", "800 000 - 1 000 000"}:             "BMW X5",
	{"4-7", "Дизель", "Загородные", ">1 000 000"}:                      "Mercedes-Benz GLE",
	{"4-7", "Дизель", "Пересеченные местности", "<100 000"}:            "Kia Sorento",
	{"4-7", "Дизель", "Пересеченные местности", "100 000 - 500 000"}:   "Lexus GX",
	{"4-7", "Дизель", "Пересеченные местности", "500 000 - 800 000"}:   "Audi A6",
	{"4-7", "Дизель", "Пересеченные местности", "800 000 - 1 000 000"}: "Mazda MX-5 Miata",
	{"4-7", "Дизель", "Пересеченные местности", ">1 000 000"}:          "Volvo XC60",
	{"4-7", "Гибрид", "Городские", "<100 000"}:                         "Cadillac XT4",
	{"4-7", "Гибрид", "Городские", "100 000 - 500 000"}:                "Tesla Model X",
	{"4-7", "Гибрид", "Городские", "500 000 - 800 000"}:                "GMC Acadia",
	{"4-7", "Гибрид", "Городские", "800 000 - 1 000 000"}:              "Buick Regal",
	{"4-7", "Гибрид", "Городские", ">1 000 000"}:                       "Lincoln Nautilus",
	{"4-7", "Гибрид", "Загородные", "<100 000"}:                        "Jaguar E-PACE",
	{"4-7", "Гибрид", "Загородные", "100 000 - 500 000"}:               "Porsche Panamera",
	{"4-7", "Гибрид", "Загородные", "500 000 - 800 000"}:               "Acura ILX",
	{"4-7", "Гибрид", "Загородные", "800 000 - 1 000 000"}:             "Mini Clubman",
	{"4-7", "Гибрид", "Загородные", ">1 000 000"}:                      "Fiat 500L",
	{"4-7", "Гибрид", "Пересеченные местности", "<100 000"}:            "Chrysler 200",
	{"4-7", "Гибрид", "Пересеченные местности", "100 000 - 500 000"}:   "Land Rover Defender",
	{"4-7", "Гибрид", "Пересеченные местности", "500 000 - 800 000"}:   "Infiniti QX80",
	{"4-7", "Гибрид", "Пересеченные местности", "800 000 - 1 000 000"}: "Mitsubishi Mirage",
	{"4-7", "Гибрид", "Пересеченные местности", ">1 000 000"}:          "Nissan Titan",
	{">7", "Бензин", "Городские", "<100 000"}:                          "Toyota Tundra",
	{">7", "Бензин", "Городские", "100 000 - 500 000"}:                 "Ford Ranger",
	{">7", "Бензин", "Городские", "500 000 - 800 000"}:                 "Jeep Compass",
	{">7", "Бензин", "Городские", "800 000 - 1 000 000"}:               "Chevrolet Malibu",
	{">7", "Бензин", "Городские", ">1 000 000"}:                        "Volkswagen Beetle",
	{">7", "Бензин", "Загородные", "<100 000"}:                         "Hyundai Tucson",
	{">7", "Бензин", "Загородные", "100 000 - 500 000"}:                "Subaru Impreza",
	{">7", "Бензин", "Загородные", "500 000 - 800 000"}:                "BMW 7 Series",
	{">7", "Бензин", "Загородные", "800 000 - 1 000 000"}:              "Mercedes-Benz S-Class",
	{">7", "Бензин", "Загородные", ">1 000 000"}:                       "Kia Rio",
	{">7", "Бензин", "Пересеченные местности", "<100 000"}:             "Lexus LC",
	{">7", "Бензин", "Пересеченные местности", "100 000 - 500 000"}:    "Audi Q7",
	{">7", "Бензин", "Пересеченные местности", "500 000 - 800 000"}:    "Mazda CX-9",
	{">7", "Бензин", "Пересеченные местности", "800 000 - 1 000 000"}:  "Volvo V60",
	{">7", "Бензин", "Пересеченные местности", ">1 000 000"}:           "Cadillac CT6",
	{">7", "Дизель", "Городские", "<100 000"}:                          "Tesla Model Y",
	{">7", "Дизель", "Городские", "100 000 - 500 000"}:                 "GMC Canyon",
	{">7", "Дизель", "Городские", "500 000 - 800 000"}:                 "Buick Cascada",
	{">7", "Дизель", "Городские", "800 000 - 1 000 000"}:               "Lincoln MKZ",
	{">7", "Дизель", "Городские", ">1 000 000"}:                        "Jaguar I-PACE",
	{">7", "Дизель", "Загородные", "<100 000"}:                         "Porsche Macan",
	{">7", "Дизель", "Загородные", "100 000 - 500 000"}:                "Acura TLX",
	{">7", "Дизель", "Загородные", "500 000 - 800 000"}:                "Mini Hardtop",
	{">7", "Дизель", "Загородные", "800 000 - 1 000 000"}:              "Fiat Spider",
	{">7", "Дизель", "Загородные", ">1 000 000"}:                       "Chrysler Voyager",
	{">7", "Дизель", "Пересеченные местности", "<100 000"}:             "Land Rover Range Rover Sport",
	{">7", "Дизель", "Пересеченные местности", "100 000 - 500 000"}:    "Infiniti QX50",
	{">7", "Дизель", "Пересеченные местности", "500 000 - 800 000"}:    "Mitsubishi Lancer",
	{">7", "Дизель", "Пересеченные местности", "800 000 - 1 000 000"}:  "Nissan Juke",
	{">7", "Дизель", "Пересеченные местности", ">1 000 000"}:           "Toyota Highlander",
	{">7", "Гибрид", "Городские", "<100 000"}:                          "Ford Expedition",
	{">7", "Гибрид", "Городские", "100 000 - 500 000"}:                 "Jeep Cherokee",
	{">7", "Гибрид", "Городские", "500 000 - 800 000"}:                 "Chevrolet Blazer",
	{">7", "Гибрид", "Городские", "800 000 - 1 000 000"}:               "Volkswagen Atlas",
	{">7", "Гибрид", "Городские", ">1 000 000"}:                        "Hyundai Kona",
	{">7", "Гибрид", "Загородные", "<100 000"}:                         "Subaru Crosstrek",
	{">7", "Гибрид", "Загородные", "100 000 - 500 000"}:                "BMW X3",
	{">7", "Гибрид", "Загородные", "500 000 - 800 000"}:                "Mercedes-Benz GLC",
	{">7", "Гибрид", "Загородные", "800 000 - 1 000 000"}:              "Kia Niro",
	{">7", "Гибрид", "Загородные", ">1 000 000"}:                       "Lexus NX",
	{">7", "Гибрид", "Пересеченные местности", "<100 000"}:             "Audi A3",
	{">7", "Гибрид", "Пересеченные местности", "100 000 - 500 000"}:    "Mazda CX-3",
	{">7", "Гибрид", "Пересеченные местности", "500 000 - 800 000"}:    "Volvo XC40",
	{">7", "Гибрид", "Пересеченные местности", "800 000 - 1 000 000"}:  "Cadillac ATS",
	{">7", "Гибрид", "Пересеченные местности", ">1 000 000"}:           "Tesla Model 3",
}
